In [21]:
import pandas as pd

data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

df = pd.DataFrame(data)
df

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000
3         104    David  Marketing   70000
4         105     Emma      Sales   65000

In [22]:
print("First three rows of DataFrame")
df.head(3)

First three rows of DataFrame

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000

In [23]:
print("Summary statistics for the 'Salary' column:")
print(df['Salary'].describe())
print()

Summary statistics for the 'Salary' column:
count        5.00000
mean     70000.00000
std       7905.69415
min      60000.00000
25%      65000.00000
50%      70000.00000
75%      75000.00000
max      80000.00000
Name: Salary, dtype: float64

In [24]:
print("Number of empl per dep:")
print(df['Department'].value_counts())
print()

Number of empl per dep:
Department
HR           1
IT           1
Finance      1
Marketing    1
Sales        1
Name: count, dtype: int64

In [27]:
avg_salary_per_employee = df['Salary'].mean()
print("Average salary of employees:", avg_salary_per_employee)

Average salary of employees: 70000.0

In [47]:
highest_salary = df['Salary'].max()
print("Employee(s) with the highest salary:")
print(df[df['Salary'] == highest_salary])
print()

Employee(s) with the highest salary:
   EmployeeID     Name Department  Salary
2         103  Charlie    Finance   80000

In [50]:
lowest_avg_sal = df.groupby("Department")['Salary'].mean().idxmin()
print("Department with the lowest avg salary: ",lowest_avg_sal)

Department with the lowest avg salary:  HR

In [53]:
df['Salary increase:'] = df["Salary"]*1.1
print("Frame with salary increase column: ")
df

Frame with salary increase column:

   EmployeeID     Name Department  Salary  Salary increase:
0         101    Alice         HR   60000           66000.0
1         102      Bob         IT   75000           82500.0
2         103  Charlie    Finance   80000           88000.0
3         104    David  Marketing   70000           77000.0
4         105     Emma      Sales   65000           71500.0